namespace Practice._2024_08.Mystery_Game;

public struct GameGame { public GameGame() {} private string memo =
        
        @"
            추리 게임 구상
                          
            <추리 과정>
        1. Expose Lies : 단서의 모순 찾기
        2. Follow Leads : 모순 정보 탐색, 플레이어 행동 유도
        3. Find Connections : 위 과정에서 발견한 추가 단서 및 모순 정리, 연결 고리 탐색
        4. Make Deductions : 연결 고리를 통한 플레이어의 추리, 결과
                          
            <게임 과정>
        1. 시대 배경, 장소, 인물 소개
        2. 인물간 대화
        3. 사건 발생 < 여기서 범인 및 범행도구 선택
        4. 단서 추리
        5. 범인 추리
        6. 결과
                          
            <범죄는 흔적을 남긴다>
        2024년, 여름, 무인도
        본인 포함 총 5명의 소모임
        몇 번의 모임을 가지다 운 좋게 외딴 섬의 별장을 빌려 휴가를 떠난다
                          
        1. 도착, 별장에서의 대화, 밤 산책, 취침
        2. 아침, 거실에서 모임, 한 명이 보이지 않음
        3. 사건 발생, 범행 도구 발견, 거실에서 모임 후 대화
        4. 개인 면담, 단서 정리, 범인 추리, 결과
        ";
}